Autodesk.Revit.DB.Electrical.AreaBasedLoadType.Create(Autodesk.Revit.DB.Document,System.String)
Creates an area based load type.
document:
The document in which to create the area based load type.
name:
The name of new area based load type. The actual name may be post-fixed if already exists.
Returns:
The newly created area based load type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadType.LoadClassification
The load classification of area based load type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The id is not a load classification id .
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadType.LoadDensity
The load density of area based load type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for value is not a number
-or-
When setting this property: The given value for value is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for value must be non-negative.
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadType.ApparentPowerDensity
The apparent power density of area based load type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for value is not a number
-or-
When setting this property: The given value for value is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for value must be non-negative.
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadType.PowerFactor
The power factor of area based load type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for power factor must be between 0 and 1.
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadType
This class represents an area based load type in Autodesk Revit.
Since:
2023